pecostm32/STM32F103_GT911_Conf_Reader/STM32F1_I2C_TP_conf_reader/backups/f103_siel_opera_6_master_module state machine voor input niet af.c
//Run openocd for debugging
//openocd -f ~/NetBeansProjects/STM_Drum_Box/STM32F103C8T6.cfg

#include "stm32f103_db.h"
#include "usb.h"
#include "sintab.h"
#include "parameters.h"

#define STACK_TOP 0x20005000

extern unsigned char  INIT_DATA_VALUES;
extern unsigned char  INIT_DATA_START;
extern unsigned char  INIT_DATA_END;
extern unsigned char  BSS_START;
extern unsigned char  BSS_END;

int main(void);
void resetHandler(void);
//void tim1IrqHandler(void);
//void tim2IrqHandler(void);
//void tim3IrqHandler(void);

void dmach3IrqHandler(void);
void dmach5IrqHandler(void);

void SendString(char *str);
void SendDynamicsRouting();

const void * intVectors[76] __attribute__((section(".vectors"))) =
{
    (void*) STACK_TOP,
    resetHandler,
    0,0,0,0,0,0,0,0,0,0,0,0,0,
    0,0,0,0,0,0,0,0,0,0,0,0,0,
    0,
    dmach3IrqHandler,
    0,
    dmach5IrqHandler,
    0,0,0,0,
    usbIrqHandler,
    0,0,0,0,
    0, //tim1IrqHandler,
    0,0,
    0, //tim2IrqHandler,
    0, //tim3IrqHandler,
    0,0,0,0,0,0,0,0,0
};

void resetHandler(void)
{
  unsigned char volatile *src;
  unsigned char volatile *dst;
  unsigned len;

  src= &INIT_DATA_VALUES;
  dst= &INIT_DATA_START;
  len= &INIT_DATA_END - &INIT_DATA_START;

  while(len--)
    *dst++ = *src++;

  dst = &BSS_START;

  len = &BSS_END - &BSS_START;

  while(len--)
    *dst++=0;

  main();
}

//The number of microseconds must be less then 1864135. (just over 1.8 second)
//Multiplied by 9 gives the number of ticks.
//With this it can only lead to a single timer overflow, which this function can handle
void usdelay(int32_t usec)
{
  int32_t end = STK->VAL - (usec * 9);

  //Check if there is the need to wait for an timer overflow
  if(end <= 0)
  {
    //Wait for the overflow to occur
    while((STK->CTRL & STK_CTRL_OVERFLOW) == 0);

    //calculate the new end value
    end += 0x00FFFFFF;
  }

  //Wait till the timer reaches the intended value for the given delay
  while(STK->VAL >= end);
}

//Simple function for setup of an IO pin
void InitIOPin(GPIO_TypeDef *port, uint32_t pin, uint32_t mode, uint32_t conf)
{
  //Mix the mode and configuration for single instruction usage
  uint32_t data = mode | (conf << 2);

  //Create a base pointer for either the lower or the higher control register
  __IO uint32_t *reg;

  //See if the lower control register or the higher control register needs to be used
  if(pin < 8)
  {
    //Low control register used for first 8 pins
    reg = &port->CRL;
  }
  else
  {
    //Force pin into 8 pins per register range
    pin -= 8;

    //High control register used for upper 8 pins
    reg = &port->CRH;
  }

  //4 control bits used per pin
  pin *= 4;

  //Reset bits first and set new mode and configuration.
  *reg &= ~(0x0F << pin);
  *reg |=  (data << pin);
}


//SPI1 is used to stream the high frequency signals. For now 2 signals are routed via this channel
//With 36MHz ABP1 clock and divider set to 8 (BR = 2) the word rate on SPI1 is going to be 281250 wps (words per second)
//This means a signal sample rate of 140625Hz (samples per second)
//On the DMA halfway and finished interrupt new signal values need to be calculated. This way a double buffered setup is achieved

//SPI2 is used to stream the low frequency signals. For now 5 LFO outputs are routed via this channel
//With 36MHz ABP1 clock and divider set to 32 (BR = 4) the word rate on SPI2 is going to be 70312,5 wps (words per second)
//This means a signal sample rate of 14062,5Hz (samples per second)
//On the DMA halfway and finished interrupt new signal values need to be calculated. This way a double buffered setup is achieved


//Footage can also be included in these signals. They give a shift of 2 octaves
//For LFO I and II the signals are made from four components. Three semi static parameters and the LFO sine output
//The pitch bend wheel (not the midi pitch bend based on the schematics) is routed to the DCO's based on a select switch.
//The depth wheel can amplify the effect of the lfo output.
//The master tune is always a part of the signal
//So the signal is, depending on the settings, the LFO output multiplied by the sum of the two depth settings plus the pitch bend value plus the master tune
//The two depth settings have equal influence (0 to 1, so max depth is 2)

//Pitch bend has a range of 3 semi-tones up or down
//Master tune has a range of 1 semi-tone up or down
//LFO has a range of max 2 semi-tones up or down

//For LFO II signal there is also the detune of DCO B to take into account
//Course has a range of 8 semi-tones down
//Fine has a range of half a semi-tone up or down

//For footage the multiplication factor is one of: 1, 2, 4
//Standard this signal should be 1. When there is a octave shift up (16' is lowest, then 8' and 4' is highest) it becomes 2 or 4 
//This means a need for a total of 14,5 semi-tones down and 30,5 semi-tones up (two octaves plus 6.5 semi-tones)
//Up is * 5,822612671
//Down is * 0,432768283

//For pitch this means three bits need to be used for the decimal. The rest is for the mantissa.

//With this in mind and an output frequency range for the oscillators of min 14,151522844Hz to max 6092,781775109

//The key number should provide a multiplication factor based on the semi-tone scale. This factor needs to be multiplied with the pitch factor
//The result represents the needed frequency.

//HFO calculation needs to be done with 32 bits. 23 for the mantissa part and 9 for the fraction
//Multiplication is then a bit hard to do

//HFO max is 7963266,006916504Hz
//HFO min is 2367493,165381729Hz

//For now 14 bits for each signal gives a range of 16 bits in total
//So 14 bits sine table is needed.


//For the generation of the voice signals a sampling rate is needed. Hardware as it is now provides a voice clock but this is not
//usable in a sample based system. Can't make the waves with the use of a timer as first conceived.
//So will use the SPI clock to derive the sample clock from. The high frequency signals are streamed on the SPI 1. Two signals are transmitted.
//One is for the noise signal, which needs to be passed through all the devices. The second one is for the audio signal. This is an addition
//of all the separate voices. Basically an add and divide by two is needed in every module. The divide can be omitted by scaling the signals such
//that the total sum will be below the maximum allowed in the output module. (Top 12 of 16 bits)


//Buffer for two times the five low frequency signals. (DCO A tuning, DCO B tuning, DCO A PWM, DCO B PWM, VCF cutoff)
volatile int16_t lowfrequencydata[NOF_LF_WORDS] = { 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x0000, 0x00000, 0x0000, 0x0000 };

//Buffer for two times two high frequency signals. (Voice, Noise)
volatile int16_t highfrequencydata[NOF_HF_WORDS] = { 0x0000, 0x0000, 0x0000, 0x0000 };

//For random number sequencing
volatile uint32_t randx=132456789;
volatile uint32_t randy=362436069;
volatile uint32_t randz=521288629;

volatile tagMasterData masterparameters;
volatile tagVoiceData  voiceparameters;

int main(void)
{
  //Setup flash to work with 72MHz clock
  //Enable the Prefetch Buffer and Set to 2 wait states
  FLASH->ACR = FLASH_ACR_PRFTBE | FLASH_ACR_LATENCY_2;

  //Configure system clock
  //External oscillator: 8MHz
  //PLL multiplicator: x9
  //SYSCLK: 64MHz
  //AHB: SYSCLK = 72MHz
  //APB1: SYSCLK/2 = 36MHz  //Timer 2,3 and 4 run on 72MHz since APB1 divider is not 1
  //APB2: SYSCLK/2 = 36MHz  //Timer 1 also runs on 72MHz since APB2 divider is not 1
  //ADC: SYSCLK/6 = 12MHz
  //USB: SYSCLK/1.5 = 48MHz
  RCC->CFGR = RCC_CFGR_PLLMULL9 | RCC_CFGR_PLLSRC | RCC_CFGR_ADCPRE_DIV6 | RCC_CFGR_PPRE1_DIV2 | RCC_CFGR_PPRE2_DIV2;

  //Enable external oscillator
  RCC->CR |= RCC_CR_HSEON;

  //Wait for the clock to become stable
  while((RCC->CR & RCC_CR_HSERDY) != RCC_CR_HSERDY);

