pecostm32/STM32F103_GT911_Conf_Reader/STM32F1_I2C_TP_conf_reader/backups/f103_siel_opera_6_master_module state machine voor input niet af.c
  //Enable the PLL
  RCC->CR |= RCC_CR_PLLON;

  //Wait for the PLL to become stable
  while((RCC->CR & RCC_CR_PLLRDY) != RCC_CR_PLLRDY);

  //Switch to the PLL clock as system clock source. Since on reset these bits are set to 0 no need to clear first.
  RCC->CFGR |= RCC_CFGR_SW_PLL;

  //Wait for the PLL to become the clock source
  while((RCC->CFGR & RCC_CFGR_SWS_PLL) != RCC_CFGR_SWS_PLL);

  //From this point on it is not possible to change the clock configuration without switching back to HSI
  
  //Enable the clocks for the used peripherals. PORTA for USART1, PORTB for USART3, PORTC for the led, USART1, SPI1, Alternate Function IO and TIM1
  RCC->APB2ENR |= RCC_APB2ENR_IOPAEN | RCC_APB2ENR_IOPBEN | RCC_APB2ENR_IOPCEN | RCC_APB2ENR_USART1EN | RCC_APB2ENR_SPI1EN | RCC_APB2ENR_TIM1EN;

  //Enable USART2, TIM2, TIM3 and SPI2
  RCC->APB1ENR |= RCC_APB1ENR_TIM2EN | RCC_APB1ENR_TIM3EN | RCC_APB1ENR_USART2EN | RCC_APB1ENR_SPI2EN;

  //Enable the DMA
  RCC->AHBENR |= RCC_AHBENR_DMA1EN;
  
  //Enable the system timer for delay function
  //In default setting with 72MHz AHB clock this timer runs on 9MHz, so 111ns per tick. Takes 9 ticks for a microsecond
  STK->LOAD = 0x00FFFFFF;
  STK->CTRL = STK_CTRL_ENABLE;
  
  //Init the USB device
  usbInit();

  //IO pins need to be configured first
  //In reset mode IO is floating. After configuration as input with pull up or down it will take on reset setting which is pull down
  //In this case it is needed to be pull up so we set it before pin configuration
  //Enable pull up on PA0
  GPIOA->ODR |= 0x0001;
  
  //Measurement pin for interrupt timing measurement
  InitIOPin(GPIOB, 5, GPIO_MODE_2MHZ, GPIO_CONF_O_PP);
  InitIOPin(GPIOB, 6, GPIO_MODE_2MHZ, GPIO_CONF_O_PP);
  
  //Pin with LED to show activity
  InitIOPin(GPIOC, 13, GPIO_MODE_2MHZ, GPIO_CONF_O_PP);

  //General purpose input with pull up / down
  InitIOPin(GPIOA, 0, GPIO_MODE_INPUT, GPIO_CONF_I_PUPD);  //Voice module ready input
  
  //USART 1 TX
  InitIOPin(GPIOA, 9, GPIO_MODE_10MHZ, GPIO_CONF_AF_PP);   //Midi out
  
  //USART 1 RX
  InitIOPin(GPIOA, 10, GPIO_MODE_INPUT, GPIO_CONF_I_FLT);  //Midi in

  //SP1 SCK
  InitIOPin(GPIOA, 5, GPIO_MODE_50MHZ, GPIO_CONF_AF_PP);   //Audio stream clock output

  //SP1 MOSI
  InitIOPin(GPIOA, 7, GPIO_MODE_50MHZ, GPIO_CONF_AF_PP);   //Audio stream data output

  //USART 2 TX
  InitIOPin(GPIOA, 2, GPIO_MODE_10MHZ, GPIO_CONF_AF_PP);   //Configuration and parameter data output
  
  //SPI 2 SCK
  InitIOPin(GPIOB, 13, GPIO_MODE_50MHZ, GPIO_CONF_AF_PP);  //Low speed signal stream clock output
  
  //SPI 2 MOSI
  InitIOPin(GPIOB, 15, GPIO_MODE_50MHZ, GPIO_CONF_AF_PP);  //Low speed signal stream data output
  
  /*
  //Timer 1 is used to make the carrier for the sine instruments. It gives a frequency of 70312,5Hz
  TIM1->PSC = 0;
  TIM1->CNT = 0;
  TIM1->ARR = 1023;
  TIM1->CCR1 = 512; //Duty cycle control
  TIM1->RCR = 4;    //Interrupt generated only every 5th reload

  //Timer 1 up counting with compare output on channel 1. Output in PWM1 mode and preload enabled
  TIM1->CCMR1 = TIM_CCMR1_OC1PE | TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_1;
  TIM1->CCER = TIM_CCER_CC1E;
  TIM1->CR1 = TIM_CR1_CEN | TIM_CR1_ARPE;
  TIM1->DIER = TIM_DIER_UIE;
  TIM1->BDTR = TIM_BDTR_MOE;  //Enable outputs

  //Timer 2
  TIM2->CNT = 0;
  TIM2->PSC = 15999;  //72MHz / 16000 = 4500Hz
  TIM2->ARR = 1124;   //4500Hz / 1125 = 4Hz;
  TIM2->CCR1 = 562;   //50% duty cycle on the output;

  //Timer 2 generates an interrupt at a 2Hz rate
  TIM2->CCMR1 = TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_1;
  TIM2->CCER = TIM_CCER_CC1E;
  TIM2->DIER = TIM_DIER_UIE;
  TIM2->CR1 = TIM_CR1_CEN | TIM_CR1_ARPE;

  //Timer 3 is used to make the carrier for noise instruments. It gives a frequency of 70312,5Hz
  TIM3->PSC = 0;
  TIM3->CNT = 383;
  TIM3->ARR = 1023;
  TIM3->CCR1 = 512; //Duty cycle control
  TIM3->RCR = 1;    //Interrupt generated only every 2th reload

  //Timer 3 up counting with compare output on channel 1. Output in PWM1 mode and preload enabled
  TIM3->CCMR1 = TIM_CCMR1_OC1PE | TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_1;
  TIM3->CCER = TIM_CCER_CC1E;
  TIM3->DIER = TIM_DIER_UIE;
  TIM3->CR1 = TIM_CR1_CEN | TIM_CR1_ARPE;
*/

  //Setup the DMA for the high frequency signal stream
  //Set the address of the slave SPI data register as DMA destination and the high frequency data as source
  DMA1_Channel3->CPAR = (uint32_t)&SPI1->DR;
  DMA1_Channel3->CMAR = (uint32_t)highfrequencydata;
  DMA1_Channel3->CNDTR = NOF_HF_WORDS;
  //Memory increment with circular buffer transferring from memory 16 bits per transfer
  DMA1_Channel3->CCR = DMA_CCR_MINC | DMA_CCR_CIRC | DMA_CCR_DIR | DMA_CCR_MSIZE_0 |  DMA_CCR_PSIZE_0 | DMA_CCR_HTIE | DMA_CCR_TCIE; // | DMA_CCR_EN;
  
  //Enable the low frequency signal stream interface and setup for master mode, clock/8, falling edge low start clock, 16 bit, msb first out and transmit only
  SPI1->CR1 = SPI_CR1_SPE | SPI_CR1_MSTR | SPI_CR1_BR_DIV8 | SPI_CR1_CPOL | SPI_CR1_DFF | SPI_CR1_SSM | SPI_CR1_SSI;
  SPI1->CR2 = SPI_CR2_SSOE | SPI_CR2_TXDMAEN;
  
  //Setup the DMA for the low frequency signal stream
  //Set the address of the slave SPI data register as DMA destination and the low frequency data as source
  DMA1_Channel5->CPAR = (uint32_t)&SPI2->DR;
  DMA1_Channel5->CMAR = (uint32_t)lowfrequencydata;
  DMA1_Channel5->CNDTR = NOF_LF_WORDS;
  //Memory increment with circular buffer transferring from memory 16 bits per transfer
  DMA1_Channel5->CCR = DMA_CCR_MINC | DMA_CCR_CIRC | DMA_CCR_DIR | DMA_CCR_MSIZE_0 |  DMA_CCR_PSIZE_0 | DMA_CCR_HTIE | DMA_CCR_TCIE; // | DMA_CCR_EN;
  
  //Enable the low frequency signal stream interface and setup for master mode, clock/32, falling edge low start clock, 16 bit, msb first out and transmit only
  SPI2->CR1 = SPI_CR1_SPE | SPI_CR1_MSTR | SPI_CR1_BR_DIV32 | SPI_CR1_CPOL | SPI_CR1_DFF | SPI_CR1_SSM | SPI_CR1_SSI;
  SPI2->CR2 = SPI_CR2_SSOE | SPI_CR2_TXDMAEN;

  //Setup DMA for USART2 transmission
  //Set the address of the USART data register as DMA destination and the parameter data as source
  DMA1_Channel7->CPAR = (uint32_t)&USART2->DR;
  DMA1_Channel7->CMAR = (uint32_t)&voiceparameters;
  DMA1_Channel7->CNDTR = sizeof(voiceparameters);
  //Memory increment with circular buffer transferring from memory 8 bits per transfer
  DMA1_Channel7->CCR = DMA_CCR_MINC | DMA_CCR_CIRC | DMA_CCR_DIR; // | DMA_CCR_EN;
  
  //Enable the parameter stream interface. Setup for asynchronous transmission of 8 bits, 1 stop bit, no parity. 2250000 bits per second
  USART2->CR1 = USART_CR1_UE | USART_CR1_TE;
  USART2->CR3 = USART_CR3_DMAT;
  USART2->BRR = 16;

