pecostm32/STM32F103_GT911_Conf_Reader/STM32F1_I2C_TP_conf_reader/backups/f103_siel_opera_6_master_module state machine voor input niet af.c
  //Set priority for timer 1, 2 and 3 interrupt to be higher then the other interrupts
  //This is an array of 8 bit registers, of which only the upper 4 bits are used for the priority allowing for 16 levels
  //By grouping this is separated to allow for having sub priorities within a single group.
  //In the usb init this is set for 4 group priorities with each 4 sub priorities.
  //The higher the number the lower the priority
//  NVIC->IP[TIM1_UP_IRQn] = 0x80;  //(1000b) Group priority 2, sub priority 0
//  NVIC->IP[TIM2_IRQn]    = 0x90;  //(1001b) Group priority 2, sub priority 1
//  NVIC->IP[TIM3_IRQn]    = 0x40;  //(0100b) Group priority 1, sub priority 0
  NVIC->IP[DMA1_Channel3_IRQn] = 0x50;  //(0101b) Group priority 1, sub priority 1
  NVIC->IP[DMA1_Channel5_IRQn] = 0x40;  //(0100b) Group priority 1, sub priority 0
  
  //Enable the timer 1 and 2 interrupt
  //This is an array of 32 bit registers, only used to enable an interrupt. To disable the ICER registers need to be used
  //Each register serves 32 interrupts, so to get the register for the interrupt, shift the IRQ number right 5 times (divide by 32) and to get
  //the right interrupt enable bit, shift a unsigned 32 bit integer 1 the IRQ number anded with 31 (modulo 32) times to the right
//  NVIC->ISER[TIM1_UP_IRQn >> 0x05] = (uint32_t)0x01 << (TIM1_UP_IRQn & 0x1F);
//  NVIC->ISER[TIM2_IRQn >> 0x05] = (uint32_t)0x01 << (TIM2_IRQn & 0x1F);
//  NVIC->ISER[TIM3_IRQn >> 0x05] = (uint32_t)0x01 << (TIM3_IRQn & 0x1F);
  NVIC->ISER[DMA1_Channel3_IRQn >> 0x05] = (uint32_t)0x01 << (DMA1_Channel3_IRQn & 0x1F);
  NVIC->ISER[DMA1_Channel5_IRQn >> 0x05] = (uint32_t)0x01 << (DMA1_Channel5_IRQn & 0x1F);

  
  //Wait for PA0 to go low
//  while(GPIOA->IDR & 0x0001);
  
  //Wait for PA0 to go high again
//  while((GPIOA->IDR & 0x0001) == 0);
  
  //Voice modules are ready so start streaming
  DMA1_Channel3->CCR |= DMA_CCR_EN;
  DMA1_Channel5->CCR |= DMA_CCR_EN;
  DMA1_Channel7->CCR |= DMA_CCR_EN;
  
  int16_t c;
  uint8_t state   = STATE_WAIT_INPUT;
  uint8_t mode    = COMMAND_MODE_NONE;
  uint8_t *target = 0;
  
  while(1)
  {
    //Read a character from the USB receive buffer
    c = usbRead();
    
    //Check if any data to process
    if(c != -1)
    {
      //Process the data based on the current state
      switch(state)
      {
        case STATE_WAIT_INPUT:
          //Check if a Set or Get instruction received
          if(c == 'S')
          {
            state = STATE_WAIT_COMMAND;
            mode  = COMMAND_MODE_SET;
          }
          else if(c == 'G')
          {
            state = STATE_WAIT_COMMAND;
            mode  = COMMAND_MODE_GET;
          }
          else if((c != 0x0D) && (c != 0x0A))
            SendString("E0\n");
          break;

        case STATE_WAIT_COMMAND:
          //Check on start of command received
          switch(c)
          {
            default:
              //Reset state machine on erroneous input
              state = STATE_WAIT_INPUT;
              mode  = COMMAND_MODE_NONE;
              
              //On not recognized character an error 1 is returned
              SendString("E1\n");
              break;
              
            case 'D':
              //Start of D commands
              state = STATE_WAIT_D;
              break;
              
            case 'E':
              //Start of E commands
              state = STATE_WAIT_E;
              break;
              
            case 'F':
              //Start of F commands
              state = STATE_WAIT_F;
              break;
              
            case 'L':
              //Start of L commands
              state = STATE_WAIT_L;
              break;
              
            case 'M':
              //Start of M commands
              state = STATE_WAIT_M;
              break;
              
            case 'N':
              //Start of N commands
              state = STATE_WAIT_N;
              break;
              
            case 'P':
              //Start of P commands
              state = STATE_WAIT_P;
              break;
              
            case 'V':
              //Start of V commands
              state = STATE_WAIT_V;
              break;
          }
          break;
          
        case STATE_WAIT_D:
          switch(c)
          {
            default:
              //Reset state machine on erroneous input
              state = STATE_WAIT_INPUT;
              mode  = COMMAND_MODE_NONE;
              
              //On not recognized character after D an error 2 is returned
              SendString("E2\n");
              break;
              
            case 'C':
              //Start of DCO commands
              state = STATE_WAIT_DCO;
              break;

            case 'R':
              //Dynamics Routing needs to be handled based on mode
              if(mode == COMMAND_MODE_SET)
              {
                //Start of Dynamics Routing command
                state = STATE_WAIT_DYNAMICS_ROUTING;
              }
              else if(mode == COMMAND_MODE_GET)
              {
                //On a get return the current dynamics routing
                SendDynamicsRouting();
                
                //Reset state machine when done
                state = STATE_WAIT_INPUT;
                mode  = COMMAND_MODE_NONE;
              }
              break;
              
            case 'W':
              //Start of Depth Wheel commands
              state = STATE_WAIT_DEPTH_WHEEL;
              break;
          }
          break;
          
        case STATE_WAIT_DCO:
          if(c == 'O')
            state = STATE_WAIT_DCO_LETTER;
          else
          {
             //Reset state machine on erroneous input
             state = STATE_WAIT_INPUT;
             mode  = COMMAND_MODE_NONE;

             //On not recognized character after DC an error 3 is returned
             SendString("E3\n");
          }
          break;
          
        case STATE_WAIT_DCO_LETTER:
          if(c == 'A')
          {
            
