pecostm32/STM32F103_GT911_Conf_Reader/STM32F1_I2C_TP_conf_reader/backups/f103_siel_opera_6_master_module state machine voor input niet af.c
          }
          if(c == 'B')
          {
            
          }
          else
          {
             //Reset state machine on erroneous input
             state = STATE_WAIT_INPUT;
             mode  = COMMAND_MODE_NONE;

             //On not recognized character after DC an error 3 is returned
             SendString("E3\n");
          }
          break;
      }
    }
    
    //Hier een soort state machine maken die de binnen komende data verwerkt.
    //Eerst dus een lijst van mogelijke commando's maken.
    
    //xxx => 0 - 255
    //t => S for set or G for get
    //Command is terminated with CR
    
    //Master module only settings
    //tMT=xxx        Master Tune.
    //tPW=xxx        Pitch Wheel value.
    //tDW=xxx        Depth wheel value.
    //tPWR=r         Pitch wheel routing.  r => A for DCO A, B for DCO B or AB for both
    //tDWR=r         Depth wheel routing.  r => 1 for LFO I-II, 3 for LFO III or 13 for both
    //tLFOyD=xxx     LFO Depth.            y => 1 or 3
    //tLFOyS=xxx     LFO Speed.            y => 1 or 3
    //tLFOyR=r       LFO Routing.          y => 1 or 3  r => none for no routing, A for DCO A, B for DCO B, F for Filter (only when y = 3) Combination of parms for multiple routing
    //tLFO3W=w       LFO III waveform.     w => T for Triangle, Q for sQuare or TQ for both
    //tNL=xxx        Noise Level.
    //tPWy=xxx       Pulse Width for DCO.  y => A or B
    //tDCOBDy=xxx    DCO B detune.         y => F for fine or C for coarse
    //tDCOyF=z       DCO footage.          y => A or B  z => 16, 8, 4
    
    //Voice module settings
    //tMV=xxx        Master Volume
    //tEGA=xxx       Envelope Generator Attack
    //tEGD=xxx       Envelope Generator Decay
    //tEGS=xxx       Envelope Generator Sustain
    //tEGR=xxx       Envelope Generator Release    
    //tFC=xxx        Filter Cutoff
    //tFR=xxx        Filter Resonance
    //tFA=xxx        Filter ADSR amount
    //tFK=y          Filter Keyboard tracking              y => 0 or 1
    //tDCOyW=w       DCO Waveform                          y => A or B  w => none for no waveform, S for Sawtooth, Q for sQuare or SQ for both
    //tDCOBH=h       DCO B Half volume                     h => 0 or 1
    //tEGOR=r        Envelope Generator Output Routing     r => none for no routing, F for Filter, A for Amplifier, FA for both
    //tDR=r          Dynamics Routing                      r => none for no routing, L for EG level, T for Attack Time, LT for both
    //tVnK=xxx       Voice Key value                       n => 1 to 6 for specific voice
    //tVnD=xxx       Voice Dynamics value                  n => 1 to 6 for specific voice
    //tVnG=g         Voice Gate value (Key pressed)        g => 0 or 1
    
    
    

//      usbSend(c);
  }
}

//Send a string to the USB port
void SendString(char *str)
{
  while(*str)
  {
    usbSend(*str);
    str++;
  }
}

void SendDynamicsRouting()
{
  SendString("Dynamics Routing: ");
  
  if(voiceparameters.DynamicsToAttackTime)
    usbSend('T');
    
  if(voiceparameters.DynamicsToEnvelopeLevel)
    usbSend('L');
  
  usbSend(0x0D);
  usbSend(0x0A);
}


//On DMA channel 3 halfway and finished interrupt new high frequency signal samples are calculated
void dmach3IrqHandler(void)
{
  int16_t  noise = 0;
  uint32_t randt;

  //Set pin for time measurement
  GPIOB->ODR |= 1 << 5;
  
  //Generate random number for noise
  randx ^= randx << 16;
  randx ^= randx >> 5;
  randx ^= randx << 1;

  randt = randx;
  randx = randy;
  randy = randz;
  randz = randt ^ randx ^ randy;

  //Output in range of +/-400, so in total less then 10 bits signed data
  //In the voice modules this can be added to the voice signal
  //Each voice signal can consist of 4 waves. So in total 5 signals of +/-400 added together can result in a max of +/-2000, which is slightly less then the 12 bits of the DAC
  noise = (int32_t)(randz) % 400;
  
  //The noise signal needs to have a minimal amount always present to allow the filters to self oscillate.
  //So master noise level needs to be > 0 at minimum and 1 at maximum.
  
  
  //Check on DMA flags to see if half way and if not check on fully done
  if(DMA1->ISR & DMA_ISR_HTIF3)
  {
    //Modify first half of the buffer
    highfrequencydata[1] = noise;
  }
  else if(DMA1->ISR & DMA_ISR_TCIF3)
  {
    //Modify second half of the buffer
    highfrequencydata[3] = noise;
  }

  //Clear all the possible channel5 interrupts
  DMA1->IFCR = DMA_IFCR_CGIF3 | DMA_IFCR_CTCIF3 | DMA_IFCR_CHTIF3 | DMA_IFCR_CTEIF3;
  
  //Clear pin for time measurement
  GPIOB->ODR &= ~(1 << 5);
}

//On DMA channel 5 halfway and finished interrupt new low frequency signal samples are calculated
void dmach5IrqHandler(void)
{
  //Set pin for time measurement
  GPIOB->ODR |= 1 << 6;
    
  //Check on DMA flags to see if half way and else check on fully done
  if(DMA1->ISR & DMA_ISR_HTIF5)
  {
    //Modify first half of the buffer
//    lowfrequencydata[0] = 0x0;
  }
  else if(DMA1->ISR & DMA_ISR_TCIF5)
  {
    //Modify second half of the buffer
//    lowfrequencydata[3] = 0x0;
  }

  //Clear all the possible channel5 interrupts
  DMA1->IFCR = DMA_IFCR_CGIF5 | DMA_IFCR_CTCIF5 | DMA_IFCR_CHTIF5 | DMA_IFCR_CTEIF5;
  
  //Clear pin for time measurement
  GPIOB->ODR &= ~(1 << 6);
}
